{
    "projects": [
        {
            "name": "Zahlenraten",
            "category": "games",
            "description": {
                "de": "Zahlenraten ist ein interaktives Multiplayer-Zahlenratespiel, bei dem sich Spieler über Lobbies zusammenfinden und gemeinsam eine geheime Zahl erraten. Der Host erstellt eine Lobby mit individuell einstellbarem Zahlenbereich und...",
                "en": "Zahlenraten is an interactive multiplayer number guessing game where players gather in lobbies to collectively guess a secret number. The host creates a lobby with individually adjustable number range and player limit..."
            },
            "image": "zahlenraten-banner.jpg",
            "url": "https://zahlenraten.emilsleeper.com/",
            "debug_url": "http://localhost:5005/"
        },
        {
            "name": "BBS Movie Studio",
            "category": "minecraft",
            "description": {
                "de": "BBS Movie Studio ist ein kompaktes Film‑Modpack rund um den BBS Mod von McHorse, mit dem du in Minecraft komplexe Szenen, Animationen und komplette Filme erstellen kannst. Durch Blockbench‑Model‑Support, fein justierbare Bewegungen und zahlreiche...",
                "en": "BBS Movie Studio is a compact film modpack centered around the BBS mod by McHorse, with which you can create complex scenes, animations, and complete films in Minecraft. Thanks to Blockbench model support, finely adjustable movements, and numerous..."
            },
            "image": "bbs-banner.jpg",
            "url": "https://bbsmoviestudio.emilsleeper.com/",
            "debug_url": "http://localhost:5007/"
        },
        {
            "name": "Smooth Gamemode Switcher",
            "category": "minecraft",
            "description": {
                "de": "Smooth Gamemode Switcher ist ein Mod, der es dir ermöglicht, mit einer einzigen Taste schnell zwischen den Spielmodi deiner Wahl in der gewünschten Reihenfolge zu wechseln. Beim Wechsel vom Zuschauermodus zum Kreativmodus befindest du...",
                "en": "Smooth Gamemode Switcher is a mod allowing you to have one hotkey to quickly switch between the gamemodes of your choice in your desired order. When switching from spectator to creative you will be in fly mode if you are at a..."
            },
            "image": "smoothgamemodeswitcher.jpg",
            "url": "https://smoothgamemodeswitcher.emilsleeper.com/",
            "debug_url": "http://localhost:5004/"
        },
        {
            "name": "Light Flight",
            "category": "minecraft",
            "description": {
                "de": "Light Flight ist ein leichtgewichtiger Minecraft Mod, der einen Hotkey hinzufügt, der standardmäßig die Caps Lock-Taste ist, die als normale Taste verwendet wird, nicht als Toggle-Taste, um den Flugmodus zu aktivieren oder zu...",
                "en": "Light Flight is a lightweight Minecraft Mod, that adds one hotkey, which by default is the caps lock key, used as a normal key, not in a toggle way, to enable or disable flight mode, no matter what gamemode you currently..."
            },
            "image": "lightflight.jpg",
            "url": "https://lightflight.emilsleeper.com/",
            "debug_url": "http://localhost:5003/"
        },
        {
            "name": "Inactivity Scripts",
            "category": "minecraft",
            "description": {
                "de": "Inactivity Scripts ist ein Paper Plugin, das Befehle/Skripte bei vier verschiedenen Ereignissen ausführt, wenn der Server startet, wenn der Server stoppt und wenn sich die Spieleranzahl auf 1 oder 0 ändert. Du kannst entscheiden, ob du einen...",
                "en": "Inactivity Scripts is a Paper Plugin that runs Commands/Scripts on four different events, when the server starts, when the server stops, and when the player count changes to 1 or 0. You can decide if you want to set a breakpoint, that waits for..."
            },
            "image": "inactivityscripts.jpg",
            "url": "https://inactivityscripts.emilsleeper.com/",
            "debug_url": "http://localhost:5006/"
        },
        {
            "name": "Stadtführer Görlitz",
            "category": "apps",
            "description": {
                "de": "Die App \"Stadtführer Görlitz\" gibt basierend auf dem Standort beim Laufen durch Görlitz zufällig Informationen über Gebäude und Sehenswürdigkeiten in der Nähe. Die App entsteht im Rahmen einer Arbeit um zu zeigen, wie gefährlich Standortortung...",
                "en": "The app \"Stadtführer Görlitz\" gives, based on the location while walking through Görlitz, random information about buildings and sights nearby. The app is created as part of a work to show how dangerous location tracking can be, and how to use..."
            },
            "image": "stadtfuehrer.jpg",
            "url": "https://stadt.emilsleeper.com/",
            "debug_url": "http://localhost:5001/"
        },
        {
            "name": "Echt oder erfunden?",
            "category": "games",
            "description": {
                "de": "Kleines Spiel: echt oder erfunden?",
                "en": "Small game: real or made up?"
            },
            "image": "profile.jpg",
            "url": "#"
        },
        {
            "name": "Avatar",
            "category": "apps",
            "description": {
                "de": "Avatar Projekt.",
                "en": "Avatar project."
            },
            "image": "profile.jpg",
            "url": "#"
        },
        {
            "name": "Elixir Guesser",
            "category": "games",
            "description": {
                "de": "Ein Ratespiel namens Elixir Guesser.",
                "en": "A guessing game called Elixir Guesser."
            },
            "image": "profile.jpg",
            "url": "#"
        }
    ]
}